{
    "experience": [
        {
            "title": "Student Assistant",
            "company": "Lawrence Berkeley National Laboratory",
            "span": "06-2025 to Present",
            "location": "Berkeley, CA",
            "description": [
                "Implemented and documented a full design system consisting of several dozen user interface components from Figma design specifications using React, Typescript, Vite, and SCSS.",
                "Developed visual regression tests using Jest and Storybook, achieving 100% code coverage and UI consistency."
            ]
        },
        {
            "title": "Research Assistant",
            "company": "University of California, Irvine",
            "span": "11-2024 to Present",
            "location": "Irvine, CA",
            "description": [
                "Implemented parallelized random sampling on Linux systems, allowing an up to 16 times decrease in runtime.",
                "Decreased build times by 25% by eliminating redundancy and optimizing the Makefile.",
                "Developed in-house hosted web frontends for research applications using React and Express."
            ]
        },
        {
            "title": "Summer Technology Intern",
            "company": "Alameda County Information and Technologies Department",
            "span": "06-2022 to 08-2022",
            "location": "Oakland, CA",
            "description": [
                "Configured and repaired private networks systems components, such as switches, firewalls, and routers, allowing for faster communications and network connection in three new buildings.",
                "Uninstalled and disk wiped nonessential servers in the Oakland data center, optimizing the network."
            ]
        },
        {
            "title": "Engineering Intern",
            "company": "Hewlett Packard Enterprise",
            "span": "05-2021 to 08-2021",
            "location": "Remote",
            "description": [
                "Developed a Python script to remotely connect and query live HPE customer services for data traffic analysis.",
                "Created suites of unit and integration tests to ensure code quality across Windows and Linux."
            ]
        }
    ]
}